In [2]:
import pandas as pd
import numpy as np

In [5]:
data=pd.Series([0.25,0.34,1.45,8.32,2.04],index=['0.2','b','c','d','e'])
data

0.2    0.25
b      0.34
c      1.45
d      8.32
e      2.04
dtype: float64

In [6]:
data['b']

0.34

In [9]:
data[0:5]

0.2    0.25
b      0.34
c      1.45
d      8.32
e      2.04
dtype: float64

In [11]:
pop={'california':[23,3.45],'texas':[43,6],'new york':[2.37,62]}
population=pd.Series(pop)
population

california    [23, 3.45]
texas            [43, 6]
new york      [2.37, 62]
dtype: object

In [14]:
population['texas']

[43, 6]

In [17]:
student={'id':[1,2,3],'marks':[50,60,70]}
stud=pd.DataFrame(student, index=['sagar','hitesh','prtik'])
stud

        id  marks
sagar    1     50
hitesh   2     60
prtik    3     70

In [18]:
pd.DataFrame(np.random.rand(3,2),columns=['fool','bar'],index=['a','b','c'])

       fool       bar
a  0.358240  0.227903
b  0.542318  0.922290
c  0.996459  0.737003

In [19]:
A=np.zeros(3,dtype=[('A','i8'),('B','f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [20]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [22]:
data=pd.Series([0.26,2.25,9.54,0.56],index=['a','b','c','d'])
data

a    0.26
b    2.25
c    9.54
d    0.56
dtype: float64

In [24]:
data['c']

9.54

In [25]:
data['b':'d']

b    2.25
c    9.54
d    0.56
dtype: float64

In [32]:
2.26 in data.values

False

In [34]:
data[0:2]

a    0.26
b    2.25
dtype: float64

In [40]:
data[(data>0.3)&(data<3.10)]

b    2.25
d    0.56
dtype: float64

In [41]:
data[['a','c']]

a    0.26
c    9.54
dtype: float64

In [46]:
marks={'marks1':[50,35,45,32],'marks2':[49,34,23,14]}
s=pd.DataFrame(marks,index=['sagar','taral','hitesh','pratik'])
s

        marks1  marks2
sagar       50      49
taral       35      34
hitesh      45      23
pratik      32      14

In [50]:
s.iloc[:3,:2]

        marks1  marks2
sagar       50      49
taral       35      34
hitesh      45      23

In [54]:
s.loc[:'hitesh',:'marks2']

        marks1  marks2
sagar       50      49
taral       35      34
hitesh      45      23

In [60]:
s.ix[:3, :'marks1']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

        marks1
sagar       50
taral       35
hitesh      45

In [5]:
import pandas as pd 
import numpy as np
a=np.random.randint(100000,1000000,(5,2))
a
pop=pd.DataFrame(a,index=['pune','mumbai','sdxsd','wadad','wadadef'],columns=['area','population'])
pop

           area  population
pune     745259      699932
mumbai   908158      432190
sdxsd    251268      943641
wadad    721248      558759
wadadef  428299      304921

In [ ]:
rng=np.randomState